In [1]:
import pandas as pd
import numpy as np
from numpy import nan as NA

# 7.1 Handling Missing Data

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
# The built-in Python None value is also treated as NA in object arrays.
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
string_data.dropna()

1    artichoke
3      avocado
dtype: object

In [6]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.fillna('missing value')

0    missing value
1        artichoke
2    missing value
3          avocado
dtype: object

In [8]:
string_data.fillna(method='backfill')

0    artichoke
1    artichoke
2      avocado
3      avocado
dtype: object

In [9]:
string_data.fillna(method='pad')

0         None
1    artichoke
2    artichoke
3      avocado
dtype: object

In [10]:
string_data.fillna(method='ffill')

0         None
1    artichoke
2    artichoke
3      avocado
dtype: object

In [11]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

## Filtering Out Missing Data

In [12]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [13]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
# This is equivalent to data.dropna().
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data[data >= 0]

0    1.0
2    3.5
4    7.0
dtype: float64

### With DataFrame.

Suppose you want to keep only rows containing a certain number of observations. You can
indicate this with the thresh argument.

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.563496 -0.853215 -0.035878
1 -0.015363  0.984876 -0.042272
2 -1.251216  2.363383 -0.294683
3  0.481982 -0.765335 -1.443381
4  0.998886  2.016470  1.458234
5 -0.920156 -0.049472  0.256943
6  0.723133  0.869405 -1.263155

In [17]:
data_frame = pd.DataFrame(np.arange(4).reshape((2,2)),index=['a','b'],columns=['c','d'])
data_frame

   c  d
a  0  1
b  2  3

In [18]:
# TypeError: Cannot index by location index with a non-integer key
# data_frame.iloc['a']

In [19]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [20]:
df

          0         1         2
0  0.563496       NaN       NaN
1 -0.015363       NaN       NaN
2 -1.251216       NaN -0.294683
3  0.481982       NaN -1.443381
4  0.998886  2.016470  1.458234
5 -0.920156 -0.049472  0.256943
6  0.723133  0.869405 -1.263155

In [21]:
df.dropna() #Dropped entire rows.

          0         1         2
4  0.998886  2.016470  1.458234
5 -0.920156 -0.049472  0.256943
6  0.723133  0.869405 -1.263155

In [22]:
df.dropna(thresh=2)

          0         1         2
2 -1.251216       NaN -0.294683
3  0.481982       NaN -1.443381
4  0.998886  2.016470  1.458234
5 -0.920156 -0.049472  0.256943
6  0.723133  0.869405 -1.263155

## Filling In Missing Data

In [23]:
df.fillna(0)

          0         1         2
0  0.563496  0.000000  0.000000
1 -0.015363  0.000000  0.000000
2 -1.251216  0.000000 -0.294683
3  0.481982  0.000000 -1.443381
4  0.998886  2.016470  1.458234
5 -0.920156 -0.049472  0.256943
6  0.723133  0.869405 -1.263155

In [24]:
df

          0         1         2
0  0.563496       NaN       NaN
1 -0.015363       NaN       NaN
2 -1.251216       NaN -0.294683
3  0.481982       NaN -1.443381
4  0.998886  2.016470  1.458234
5 -0.920156 -0.049472  0.256943
6  0.723133  0.869405 -1.263155

In [25]:
# Calling fillna with a dict, you can use a different fill value for each column.
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.563496  0.500000  0.000000
1 -0.015363  0.500000  0.000000
2 -1.251216  0.500000 -0.294683
3  0.481982  0.500000 -1.443381
4  0.998886  2.016470  1.458234
5 -0.920156 -0.049472  0.256943
6  0.723133  0.869405 -1.263155

#### The same interpolation methods available for reindexing can be used with fillna.

In [26]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0 -0.596812 -0.311993 -0.742748
1  2.020834 -0.613672  1.809575
2  0.220109 -0.622044 -2.153692
3  1.178114  0.578743 -0.451283
4 -0.580631  0.821077  1.601522
5 -1.439227 -0.778868 -0.226016

In [27]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [28]:
df

          0         1         2
0 -0.596812 -0.311993 -0.742748
1  2.020834 -0.613672  1.809575
2  0.220109       NaN -2.153692
3  1.178114       NaN -0.451283
4 -0.580631       NaN       NaN
5 -1.439227       NaN       NaN

In [29]:
df.fillna(method='ffill')

          0         1         2
0 -0.596812 -0.311993 -0.742748
1  2.020834 -0.613672  1.809575
2  0.220109 -0.613672 -2.153692
3  1.178114 -0.613672 -0.451283
4 -0.580631 -0.613672 -0.451283
5 -1.439227 -0.613672 -0.451283

In [30]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.596812 -0.311993 -0.742748
1  2.020834 -0.613672  1.809575
2  0.220109 -0.613672 -2.153692
3  1.178114 -0.613672 -0.451283
4 -0.580631       NaN -0.451283
5 -1.439227       NaN -0.451283

In [31]:
#We can even fillvalue with mean or median.
data = pd.Series([1., NA, 3.5, NA, 7])
print(data)
data.fillna(data.mean())

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 Data Transformation

## Removing Duplicates.

In [32]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [33]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [34]:
data2 = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two','two','two'],'k2': [1, 1, 2, 3, 3, 4, 4, 4,5]})
data2

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4
7  two   4
8  two   5

In [35]:
data2.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
8    False
dtype: bool

In [36]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [37]:
data.drop_duplicates() #By default use all of the columns.

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

Both of these methods by default consider all of the columns; alternatively, you can
specify any subset of them to detect duplicates. Suppose we had an additional column
of values and wanted to filter duplicates only based on the 'k1' column.

In [38]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [41]:
data2

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4
7  two   4
8  two   5

In [42]:
data2.drop_duplicates(['k1', 'k2'],keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
7  two   4
8  two   5

In [43]:
data2.drop_duplicates(['k1'],keep='last')

    k1  k2
4  one   3
8  two   5

In [44]:
data2

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4
7  two   4
8  two   5

In [45]:
data2.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
8  two   5

## Transforming Data Using a Function or Mapping

In [46]:
data = pd.DataFrame({'food': ['gmeat', 'pulled pork','gmeat','Pastrami','corned beef','Gmeat',
                              'pastrami', 'honey goat', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        gmeat     4.0
1  pulled pork     3.0
2        gmeat    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Gmeat     8.0
6     pastrami     3.0
7   honey goat     5.0
8     nova lox     6.0

In [47]:
meat_to_animal = {
'gmeat': 'goat',
'pulled pork': 'goat',
'pastrami': 'cow',
'corned beef': 'cow',
'honey goat': 'goat',
'nova lox': 'salmon'
}
print(meat_to_animal['gmeat'])

goat

In [48]:
lowercased = data['food'].str.lower()
lowercased

0          gmeat
1    pulled pork
2          gmeat
3       pastrami
4    corned beef
5          gmeat
6       pastrami
7     honey goat
8       nova lox
Name: food, dtype: object

In [49]:
data['animal'] = lowercased.map(meat_to_animal)
print(data['animal'])
data

0      goat
1      goat
2      goat
3       cow
4       cow
5      goat
6       cow
7      goat
8    salmon
Name: animal, dtype: object

          food  ounces  animal
0        gmeat     4.0    goat
1  pulled pork     3.0    goat
2        gmeat    12.0    goat
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Gmeat     8.0    goat
6     pastrami     3.0     cow
7   honey goat     5.0    goat
8     nova lox     6.0  salmon

In [50]:
# Passing a lambda function doing the same thing but with a function.
data['food'].map(lambda x: meat_to_animal[x.lower()])

0      goat
1      goat
2      goat
3       cow
4       cow
5      goat
6       cow
7      goat
8    salmon
Name: food, dtype: object

## Replacing Values.

In [51]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [52]:
# -999 can be a sentinal value, so we are replacing those with NaN.
data.replace(-999, np.nan) #Not doing inplace.

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [53]:
# If you want to replace multiple values at once, you instead pass a list and then the substitute value.
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [54]:
# To use a different replacement for each value, pass a list of substitutes.
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [55]:
# Passing a dict.
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [56]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
print(data.index)
data

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [57]:
# Like a Series, the axis indexes have a map method.
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [58]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [59]:
# If you want to create a transformed version of a dataset without modifying the original, a useful method 
# is rename.
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [60]:
"""
Using rename method can be used in conjunction with a dict-like object providing new val‐
ues for a subset of the axis labels
"""
data.rename(index={'OHIO': 'INDIANA'},columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [61]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [62]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## Discretization and Binning

In [63]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
# ages = [20, 22, 25, 27,25, 21, 23, 37, 31, 61, 45, 41, 32]

Let’s divide these into bins of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To
do so, you have to use cut, a function in pandas.

In [64]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
# cats = pd.cut(ages, bins,right=False)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [65]:
# Checking categories via codes attribute.
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [66]:
# Checking available caetgory.
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [67]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [68]:
# You can also pass your own bin names by passing a list or array to the labels option.
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
catgs = pd.cut(ages, bins, labels=group_names)
catgs

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [69]:
catgs.categories

Index(['Youth', 'YoungAdult', 'MiddleAged', 'Senior'], dtype='object')

In [70]:
catgs.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

If you pass an integer number of bins to cut instead of explicit bin edges, it will com‐
pute equal-length bins based on the minimum and maximum values in the data.
Consider the case of some uniformly distributed data chopped into fourths

In [71]:
data = np.random.rand(20)
categs = pd.cut(data, 4, precision=2)
categs

[(0.31, 0.52], (0.52, 0.73], (0.098, 0.31], (0.31, 0.52], (0.098, 0.31], ..., (0.73, 0.94], (0.31, 0.52], (0.098, 0.31], (0.52, 0.73], (0.73, 0.94]]
Length: 20
Categories (4, interval[float64]): [(0.098, 0.31] < (0.31, 0.52] < (0.52, 0.73] < (0.73, 0.94]]

In [72]:
categs.codes

array([1, 2, 0, 1, 0, 0, 0, 3, 1, 2, 2, 3, 1, 1, 0, 3, 1, 0, 2, 3],
      dtype=int8)

### With qcut

In [73]:
data = np.random.randn(1000) # Normally
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(-0.0561, 0.592], (0.592, 3.009], (-0.653, -0.0561], (-0.0561, 0.592], (-0.0561, 0.592], ..., (-0.653, -0.0561], (-0.0561, 0.592], (0.592, 3.009], (0.592, 3.009], (0.592, 3.009]]
Length: 1000
Categories (4, interval[float64]): [(-3.721, -0.653] < (-0.653, -0.0561] < (-0.0561, 0.592] < (0.592, 3.009]]

In [74]:
cats.codes

array([2, 3, 1, 2, 2, 0, 0, 1, 1, 3, 3, 0, 2, 0, 2, 3, 3, 3, 0, 1, 1, 0,
       2, 0, 2, 3, 3, 3, 0, 3, 3, 2, 0, 0, 1, 0, 0, 2, 3, 1, 1, 1, 0, 0,
       3, 1, 2, 2, 2, 2, 2, 0, 2, 0, 2, 2, 2, 2, 3, 0, 3, 0, 3, 0, 2, 0,
       0, 1, 1, 2, 1, 0, 0, 3, 1, 3, 3, 3, 2, 3, 3, 0, 1, 2, 3, 3, 3, 0,
       0, 3, 0, 2, 3, 2, 3, 1, 1, 1, 0, 3, 1, 1, 1, 2, 0, 2, 3, 1, 3, 2,
       3, 2, 1, 2, 0, 2, 1, 1, 1, 3, 0, 1, 2, 3, 0, 3, 2, 3, 2, 3, 0, 3,
       0, 1, 0, 1, 1, 2, 2, 1, 3, 1, 3, 2, 2, 3, 0, 1, 0, 0, 2, 2, 0, 0,
       2, 3, 1, 0, 2, 1, 1, 2, 3, 1, 2, 1, 2, 0, 2, 1, 3, 2, 1, 1, 0, 2,
       3, 0, 0, 0, 1, 3, 2, 3, 3, 0, 2, 3, 1, 3, 1, 2, 2, 1, 1, 0, 1, 2,
       0, 3, 2, 0, 1, 1, 1, 1, 0, 1, 0, 1, 3, 1, 2, 1, 2, 1, 0, 0, 3, 1,
       0, 0, 1, 3, 2, 1, 0, 1, 3, 3, 2, 1, 0, 0, 2, 3, 0, 2, 0, 0, 3, 3,
       3, 2, 1, 1, 1, 0, 1, 2, 3, 1, 3, 3, 1, 2, 3, 0, 0, 1, 0, 1, 1, 1,
       0, 3, 2, 2, 0, 1, 1, 1, 3, 2, 3, 2, 0, 1, 2, 0, 3, 2, 1, 2, 3, 2,
       0, 1, 2, 3, 3, 2, 1, 3, 3, 1, 3, 1, 2, 2, 0, 0, 3, 0, 2, 1, 0, 2,
       0, 1, 0, 3, 2, 1, 2, 2, 2, 2, 3, 3, 1, 0, 0, 3, 3, 1, 0, 0, 3, 3,
       2, 3, 0, 3, 1, 1, 1, 3, 1, 3, 1, 0, 0, 2, 2, 1, 1, 2, 0, 2, 3, 1,
       1, 3, 3, 1, 2, 0, 2, 0, 3, 0, 2, 0, 3, 1, 2, 2, 0, 3, 0, 3, 2, 1,
       1, 3, 3, 0, 2, 1, 3, 1, 0, 3, 3, 0, 2, 3, 2, 2, 3, 3, 0, 3, 1, 1,
       0, 1, 0, 2, 0, 0, 3, 2, 3, 0, 2, 2, 2, 0, 2, 2, 2, 1, 1, 3, 2, 1,
       3, 2, 3, 3, 0, 0, 0, 2, 0, 1, 2, 1, 0, 3, 0, 1, 2, 2, 2, 0, 1, 3,
       2, 1, 1, 0, 0, 0, 3, 3, 0, 1, 1, 0, 3, 0, 2, 3, 3, 1, 2, 1, 1, 3,
       0, 1, 1, 2, 2, 3, 2, 2, 2, 1, 0, 2, 1, 0, 2, 0, 0, 3, 1, 1, 2, 0,
       0, 0, 0, 1, 3, 2, 1, 1, 1, 1, 1, 1, 3, 0, 3, 3, 2, 0, 0, 0, 2, 1,
       1, 1, 3, 3, 1, 2, 0, 0, 1, 0, 1, 3, 0, 3, 3, 2, 0, 1, 3, 0, 0, 2,
       2, 1, 0, 0, 0, 3, 1, 0, 0, 2, 0, 1, 0, 1, 3, 1, 1, 3, 2, 1, 0, 1,
       2, 1, 3, 3, 3, 3, 2, 3, 2, 2, 1, 1, 3, 0, 2, 1, 2, 3, 0, 3, 3, 1,
       2, 1, 1, 0, 0, 1, 2, 0, 3, 2, 1, 3, 2, 2, 0, 0, 2, 2, 2, 0, 1, 0,
       0, 2, 3, 1, 3, 0, 1, 3, 2, 0, 2, 2, 2, 2, 3, 3, 3, 0, 2, 2, 3, 3,
       3, 1, 2, 3, 3, 0, 2, 2, 0, 2, 3, 3, 2, 2, 3, 1, 0, 2, 0, 0, 2, 1,
       1, 0, 0, 1, 1, 3, 3, 3, 1, 2, 0, 3, 0, 0, 2, 2, 3, 1, 3, 3, 0, 2,
       1, 0, 3, 1, 1, 0, 3, 0, 2, 1, 2, 0, 0, 2, 2, 2, 3, 2, 3, 2, 2, 0,
       0, 1, 3, 3, 2, 2, 1, 2, 3, 2, 3, 1, 3, 1, 3, 1, 1, 2, 3, 0, 0, 0,
       1, 3, 2, 1, 2, 0, 3, 2, 0, 2, 3, 0, 3, 2, 0, 1, 1, 0, 2, 2, 3, 0,
       2, 2, 1, 0, 0, 3, 3, 3, 0, 3, 1, 3, 0, 3, 3, 3, 0, 2, 3, 1, 0, 2,
       0, 3, 0, 0, 3, 0, 0, 3, 3, 1, 1, 0, 2, 0, 1, 1, 0, 0, 3, 3, 0, 2,
       1, 3, 0, 0, 2, 1, 1, 3, 1, 3, 0, 2, 1, 2, 3, 1, 3, 0, 2, 1, 2, 0,
       0, 3, 3, 0, 1, 1, 1, 3, 3, 0, 3, 1, 0, 2, 2, 3, 2, 2, 0, 2, 3, 3,
       0, 2, 1, 3, 1, 2, 3, 2, 0, 2, 2, 3, 0, 3, 1, 1, 3, 0, 0, 1, 1, 1,
       3, 3, 1, 2, 1, 2, 1, 2, 1, 0, 1, 1, 0, 0, 2, 2, 1, 3, 1, 1, 1, 3,
       0, 3, 1, 2, 2, 3, 1, 3, 2, 2, 3, 0, 2, 2, 3, 1, 2, 0, 2, 3, 0, 1,
       0, 3, 2, 3, 3, 0, 1, 3, 1, 1, 2, 0, 0, 3, 3, 1, 2, 3, 1, 3, 2, 0,
       2, 1, 0, 0, 1, 2, 3, 2, 1, 1, 1, 0, 3, 2, 3, 2, 3, 2, 3, 1, 1, 2,
       1, 2, 1, 0, 1, 0, 1, 1, 1, 2, 1, 0, 3, 3, 0, 2, 1, 0, 0, 2, 0, 3,
       2, 1, 2, 3, 0, 2, 3, 3, 1, 1, 0, 2, 2, 2, 0, 0, 1, 0, 2, 3, 2, 0,
       1, 1, 0, 1, 1, 0, 0, 3, 3, 3, 0, 3, 3, 1, 2, 1, 2, 1, 2, 0, 0, 2,
       0, 0, 2, 0, 2, 1, 2, 3, 3, 3], dtype=int8)

In [75]:
cats.describe()

                   counts  freqs
categories
(-3.721, -0.653]      250   0.25
(-0.653, -0.0561]     250   0.25
(-0.0561, 0.592]      250   0.25
(0.592, 3.009]        250   0.25

In [76]:
pd.value_counts(cats)

(0.592, 3.009]       250
(-0.0561, 0.592]     250
(-0.653, -0.0561]    250
(-3.721, -0.653]     250
dtype: int64

In [77]:
# Similar to cut you can pass your own quantiles (numbers between 0 and 1, inclusive).
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0561, 1.181], (1.181, 3.009], (-1.224, -0.0561], (-0.0561, 1.181], (-0.0561, 1.181], ..., (-1.224, -0.0561], (-0.0561, 1.181], (1.181, 3.009], (-0.0561, 1.181], (-0.0561, 1.181]]
Length: 1000
Categories (4, interval[float64]): [(-3.721, -1.224] < (-1.224, -0.0561] < (-0.0561, 1.181] < (1.181, 3.009]]

## Detecting and Filtering Outliers

In [78]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0   -0.126835  1.002408  0.329788  0.472201
1    1.587633 -0.659334  1.011528 -1.447737
2    0.583376  0.918852 -0.753457  0.082276
3   -0.608345  1.625291  0.202085  0.087502
4   -0.154643 -0.958073  1.953026  1.380218
..        ...       ...       ...       ...
995 -0.954865 -2.875996  1.062726  1.717188
996  0.165466 -1.130051  0.658822 -1.016429
997 -0.164523 -0.226528 -0.477030 -0.768185
998 -0.942417  1.392466  1.582666  0.828995
999 -1.624229  0.448419 -0.024699  0.117100

[1000 rows x 4 columns]

In [79]:
col = data[2]
col[np.abs(col) > 3]

703    3.943169
902    3.482384
Name: 2, dtype: float64

In [80]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
17   0.140131 -1.384026  1.557205  3.174954
358  0.192926 -3.092893  1.954493  0.554049
427  2.743943 -3.129635 -0.529125  0.945195
493 -0.227446  0.355700  1.796679 -3.984724
565 -3.685200  0.831927  0.762157  0.191282
577 -0.248940 -0.005647  0.164995 -3.080936
703 -0.982042  1.406527  3.943169 -0.481425
727  0.421546 -3.283680  0.065017  2.060845
787 -0.716095 -3.663390  1.497779  1.214647
799 -0.078454  0.976911 -0.758286 -3.030556
814 -1.589240 -1.467231  1.340936  3.195964
902 -2.372305 -0.381285  3.482384 -0.887885
906  3.035293  0.199420 -0.498333  0.838327

Values can be set based on these criteria. Here is code to cap values outside the inter‐
val –3 to 3:

In [81]:
data[np.abs(data) > 3] = np.sign(data) * 3
data[np.abs(data) > 3]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
..   ..  ..  ..  ..
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [82]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.017811    -0.020902     0.061026     0.059805
std       0.968756     1.024292     1.006626     0.983166
min      -3.000000    -3.000000    -2.737401    -3.000000
25%      -0.630189    -0.707880    -0.680734    -0.589121
50%       0.018324    -0.003785     0.057981     0.102310
75%       0.655056     0.689724     0.769354     0.736592
max       3.000000     2.825488     3.000000     3.000000

In [83]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0  1.0
1  1.0 -1.0  1.0 -1.0
2  1.0  1.0 -1.0  1.0
3 -1.0  1.0  1.0  1.0
4 -1.0 -1.0  1.0  1.0

In [84]:
np.abs([-1,2,-4,6,-7]) #sample np.abs test.

array([1, 2, 4, 6, 7])

## Permutation and Random Sampling

In [85]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
# df
sampler = np.random.permutation(5)
sampler

array([3, 4, 2, 1, 0])

In [86]:
df.take(sampler) # Items permutated along an axis acording to 'sampler'.

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

To select a random subset without replacement, you can use the sample method on
Series and DataFrame.

In [87]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15

To generate a sample with replacement (to allow repeat choices), pass replace=True
to sample:

In [88]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

1    7
1    7
0    5
4    4
3    6
0    5
1    7
2   -1
0    5
4    4
dtype: int64

## Computing Indicator/Dummy Variables

In [89]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [90]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [91]:
# Prefixing columns.
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

### Working with movies dataset.

In [95]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('./movies.dat', sep='::',
                        header=None, names=mnames)
movies

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [96]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [97]:
movies.head(n=10)

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

Adding indicator variables for each genre requires a little bit of wrangling. First, we
extract the list of unique genres in the dataset.

In [102]:
pd.read_table('examples/ex1.csv',delimiter=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [103]:
pd.read_table('examples/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [105]:
all_genres = []
for x in movies.genres:
     all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [106]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [110]:
# One way to construct the indicator DataFrame is to start with a DataFrame of all zeros.
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
gen = movies.genres[0]

In [111]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [112]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [113]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [114]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

A useful recipe for statistical applications is to combine get_dummies with a discreti‐
zation function like cut.

In [115]:
np.random.seed(12345)

In [116]:
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [117]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [118]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

# 7.3 String Manipulation

## String Object Methods

In [120]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [121]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

These substrings could be concatenated together with a two-colon delimiter using addition.

In [122]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

Other methods are concerned with locating substrings. Using Python’s in keyword is
the best way to detect a substring, though index and find can also be used.

In [123]:
'guido' in val

True

In [124]:
val.index(',')

1

In [126]:
val.find(':') #-1 returned on failure.

-1

In [127]:
val.count(',')

2

Replace will substitute occurrences of one pattern for another. It is commonly used
to delete patterns, too, by passing an empty string.

In [128]:
 val.replace(',', '::')

'a::b:: guido'

In [130]:
val.replace(',', '')

'ab guido'

In [132]:
val.endswith(',')

False

In [186]:
val.endswith('gudo')

False

In [137]:
# startswith() 
val.startswith('a')

True

In [138]:
val.startswith('b')

False

In [139]:
val.ljust(20)

'a,b, guido          '

In [140]:
val.rjust(20)

'          a,b, guido'

In [141]:
val.center(20)

'     a,b, guido     '

## Regular Expressions

In [142]:
import re

In [143]:
text = "foo bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

When you call re.split('\s+', text), the regular expression is first compiled, and
then its split method is called on the passed text. You can compile the regex yourself
with re.compile, forming a reusable regex object.

In [144]:
regex = re.compile('\s+')

If, instead, you wanted to get a list of all patterns matching the regex, you can use the
findall method.

In [145]:
regex.findall(text)

[' ', '\t ', ' \t']

In [146]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [148]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [150]:
m = regex.search(text)
m

regex.match returns None, as it only will match if the pattern occurs at the start of the
string.

In [151]:
 print(regex.match(text))

None

In [152]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [153]:
# If you want components of email like username, domain name and domain suffix.
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [154]:
m = regex.match('wesm@bright.net')

In [155]:
m.groups()

('wesm', 'bright', 'net')

In [156]:
# findall returns a list of tuples when the pattern has groups.
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [157]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## Vectorized String Functions in pandas

In [173]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [174]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [175]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [176]:
print(pattern)
data.str.findall(pattern, flags=re.IGNORECASE)

([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [180]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

To access elements in the embedded lists, we can pass an index to either of these
functions.

In [185]:
# matches.str.get(1)
data.str.get(1)

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [182]:
data.str[0]

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [184]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [188]:
f1 = pd.DataFrame(np.arange(20).reshape((5,4)))
f1

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [189]:
f2 = f1

In [195]:
f2.loc[:2] = 12

In [196]:
f1

    0   1   2   3
0  12  12  12  12
1  12  12  12  12
2  12  12  12  12
3  12  13  14  15
4  16  17  18  19

In [199]:
f1.iloc[0:2]

    0   1   2   3
0  12  12  12  12
1  12  12  12  12

In [200]:
f1[:2]

    0   1   2   3
0  12  12  12  12
1  12  12  12  12

In [201]:
f1.iloc[:]

    0   1   2   3
0  12  12  12  12
1  12  12  12  12
2  12  12  12  12
3  12  13  14  15
4  16  17  18  19

In [ ]:
f1.iloc[[0,2,1]]